СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/СводныйОтчетПоЗадолженностям/СводныйОтчетПоЗадолженностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СводныйОтчетПоЗадолженностям</name>
  <registerRecords>AccountingRegister.ЖурналПроводок</registerRecords>
  <registerRecords>AccumulationRegister.УспешныеПересдачи</registerRecords>
  <registerRecords>AccumulationRegister.ДинамикаЛиквидацииЗадолженностей</registerRecords>
  <attributes>
    <name>ДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Статистика</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗадолженностей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУспешныхПересдач</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентУспешныхПересдач</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/AccumulationRegisters/УспешныеПересдачи/УспешныеПересдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УспешныеПересдачи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоУспешныхПересдач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СистемаЛиквидацииАкадемическихЗадолженностей/src/AccumulationRegisters/ДинамикаЛиквидацииЗадолженностей/ДинамикаЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДинамикаЛиквидацииЗадолженностей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоВозникшихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЛиквидированныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/СводныйОтчетПоЗадолженностям/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УспешныеПересдачи Приход
	Движения.УспешныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаСтатистика Из Статистика Цикл
		Движение = Движения.УспешныеПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаСтатистика.Студент;
		Движение.Группа = ТекСтрокаСтатистика.Группа;
		Движение.Дисциплина = Дисциплина;
		Движение.КоличествоУспешныхПересдач = ТекСтрокаСтатистика.КоличествоУспешныхПересдач;
		Движение.СуммаБаллов = ТекСтрокаСтатистика.СуммаБаллов;
	КонецЦикла;

	// регистр ДинамикаЛиквидацииЗадолженностей 
	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаСтатистика Из Статистика Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Дисциплина = Дисциплина;
		Движение.Группа = ТекСтрокаСтатистика.Группа;
		Движение.КоличествоВозникшихЗадолженностей = ТекСтрокаСтатистика.КоличествоЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = ТекСтрокаСтатистика.КоличествоУспешныхПересдач;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
